{
  "title": "TO2",
  "steps": [
    {
      "title": "Настройка дефектоскопической аппаратуры с применением настроечных (стандартных) образцов\n1. Подготовить стандартный образец СО-3Р (очистить и осмотреть на дефекты).\n2. Подключить преобразователь и установить его на обозначенное место образца.\n3. Войти в меню калибровки/настройки чувствительности на приборе.\n4. Настроить чувствительность по эталону.\n"
    },
    {
      "title": "Очистка оборудования (профилактическая очистка месячная)\n1. Отключить прибор от питания и снять все внешние кабели.\n2. Удалить пыль и грязь с корпуса мягкой кисточкой и сухой салфеткой.\n3. Промыть оптические поверхности преобразователей безворсовой салфеткой; при сильных загрязнениях использовать спирт.\n4. Протереть разъёмы и контакты сухой салфеткой; при сильной окислю повреждении сообщить о необходимости обслуживания.\n5. После очистки собрать оборудование, подключить и проверить работоспособность."
    },
    {
      "title": "Проверка состояния аккумуляторной батареи, зарядка\n1. Осмотреть батарею на наличие вздутия, трещин или подтёков — при проблемах батарею заменить.\n2. Проверить уровень заряда и напряжение (если есть индикатор или мультиметр).\n3. Полностью зарядить батарею согласно инструкции производителя.\n4. Выполнить проверку времени работы батареи: запустить прибор и замерить, сколько часов он проработал от батареи (если это позволяет регламент)."
    },
    {
      "title": "Проверка состояния батареи планшета, зарядка\n1. Осмотреть планшет на внешние повреждения и нагрев корпуса.\n2. Проверить уровень заряда и индикатор здоровья батареи в системе планшета.\n3. Полностью зарядить планшет и перезагрузить устройство.\n4. Убедиться, что планшет корректно подключается к дефектоскопу и передаёт данные.\n5. Если батарея быстро садится или планшет зависает — сообщить о проблеме."
    },
    {
      "title": "Регулировка натяжения цепей сканера, смазка\n1. Отключить питание и зафиксировать сканер в безопасном положении.\n2. Проверить визуально натяжение цепей и направляющих — цепь не должна провисать.\n3. При необходимости ослабить натяжитель, отрегулировать положение цепи и зафиксировать без провисаний.\n4. Нанести небольшое количество рекомендованной смазки на цепи и движущиеся части.\n5. Проверить ход сканера вручную — движение должно быть плавным, без заеданий.\n6. Удалить излишки смазки и протереть чистой салфеткой."
    },
    {
      "title": "Проверка состояния болтовых соединений, протяжка\n1. Визуально пройтись по всем видимым болтовым соединениям, опорам и кронштейнам.\n2. Проверить болты на люфт ручным усилием; те, которые болтаются — подтянуть.\n3. Не перетягивать болты: подтягивать до плотности, указанной в регламенте, либо до отсутствия люфта."
    },
    {
      "title": "Проверка состояния опорных колес, подшипников, смазка\n1. Проверить опорные колеса на предмет износа, трещин и деформаций.\n2. Провернуть колёса вручную — слушать посторонние звуки, проверять люфт.\n3. Нанести рекомендованную смазку на подшипники и проверить ход.\n4. При сильном износе или люфте — сообщить об этои.\n5. После смазки убедиться в отсутствии утечек смазочного материала на ходовых частях."
    }
  ]
}
