{
  "title": "TO2",
  "steps": [
    {
      "title": "Setting up the flaw detection equipment using calibration (standard) blocks\n1. Prepare the standard block СО-3Р (clean and inspect for defects).\n2. Connect the probe and place it on the designated area of the block.\n3. Enter the calibration/sensitivity setting menu on the instrument.\n4. Adjust the sensitivity according to the reference standard."
    },
    {
      "title": "Equipment cleaning (monthly preventive cleaning)\n1. Disconnect the instrument from power and remove all external cables.\n2. Remove dust and dirt from the housing using a soft brush and a dry cloth.\n3. Clean the optical surfaces of the probes with a lint-free cloth; use alcohol for heavy soiling.\n4. Wipe the connectors and contacts with a dry cloth; if severe oxidation or damage is present, report the need for service.\n5. After cleaning, reassemble the equipment, connect it, and check its functionality."
    },
    {
      "title": "Checking the condition of the battery, charging\n1. Inspect the battery for swelling, cracks, or leaks — replace the battery if any issues are found.\n2. Check the charge level and voltage (if an indicator or multimeter is available).\n3. Fully charge the battery according to the manufacturer's instructions.\n4. Perform a battery runtime check: start the instrument and measure how many hours it operates on battery power (if permitted by the regulations)."
    },
    {
      "title": "Checking the condition of the tablet battery, charging\n1. Inspect the tablet for external damage and case heating.\n2. Check the charge level and battery health indicator in the tablet's system.\n3. Fully charge the tablet and restart the device.\n4. Ensure the tablet connects correctly to the flaw detector and transmits data.\n5. If the battery drains quickly or the tablet freezes, report the problem."
    },
    {
      "title": "Adjusting scanner chain tension, lubrication\n1. Disconnect the power and secure the scanner in a safe position.\n2. Visually check the tension of the chains and guides — the chain should not sag.\n3. If necessary, loosen the tensioner, adjust the chain position, and secure it without sagging.\n4. Apply a small amount of recommended lubricant to the chains and moving parts.\n5. Check the scanner movement manually — it should be smooth, without jamming.\n6. Remove excess lubricant and wipe with a clean cloth."
    },
    {
      "title": "Checking the condition of bolted connections, tightening\n1. Visually inspect all visible bolted connections, supports, and brackets.\n2. Check bolts for play by hand; tighten those that are loose.\n3. Do not overtighten bolts: tighten to the torque specified in the regulations, or until there is no play."
    },
    {
      "title": "Checking the condition of support wheels, bearings, lubrication\n1. Check the support wheels for wear, cracks, and deformation.\n2. Rotate the wheels by hand — listen for unusual noises, check for play.\n3. Apply the recommended lubricant to the bearings and check their movement.\n4. If significant wear or play is found, report it.\n5. After lubrication, ensure there are no lubricant leaks on the running parts."
    }
  ]
}
