{
  "title": "TO3",
  "steps": [

    {
      "title": "Настройка дефектоскопа в соответствии с техническими данными\n1. Включить прибор и дождаться полной загрузки.\n2. Открыть меню настроек и сверить текущие параметры с техническим паспортом (значения чувствительности, усиления, скорости записи и т. п.).\n3. При необходимости изменить параметры так, чтобы они соответствовали заводским или регламентным данным.\n4. Применить и сохранить настройки, сделать контрольную запись на эталонном образце (если возможно) для подтверждения корректности."
    },
    {
      "title": "Замена неисправных деталей, соединителей, переключателей, кабелей, проводов и др.\n1. По результатам осмотра и диагностики составить список деталей, требующих замены.\n2. Отключить питание и аккуратно заменить неисправную деталь на заводской аналог или на деталь, указанную в регламенте.\n3. После замены проверить работоспособность заменённого узла (включение, тестовые циклы)."
    },
    {
      "title": "Разборка и ремонт ультразвуковых преобразователей\n1. Отключить питание и вынуть ультразвуковые преобразователи согласно инструкции по разборке.\n2. Осмотреть пластины, контакты, кабели и крепления на предмет повреждений и коррозии.\n3. Подключить преобразователи и выполнить тестовую проверку их работы (передача/приём сигнала) и записать результаты."
    },
    {
      "title": "Очистка корпуса электронного блока и деталей дефектоскопа от загрязнений и коррозии с последующей окраской зачищенных мест\n1. Отключить питание и демонтировать корпуса (см. шаг разборки).\n2. Удалить пыль и грязь мягкой кисточкой и безворсовой салфеткой.\n3. Зачистить мелкие участки коррозии щёткой или мелкой наждачной шкуркой до чистого металла.\n4. Нанести антикоррозионную обработку (приказ/регламент) и дать высохнуть.\n5. Покрасить зачищенные места подходящей краской по регламенту и дать полностью высохнуть.\n6. После высыхания собрать узел и проверить, что краска не мешает соединениям и креплениям."
    },
    {
      "title": "Сборка, настройка и испытания дефектоскопа\n1. Аккуратно собрать прибор, вернуть все уплотнения на места, закрепить винты в правильной последовательности.\n2. Подключить аккумулятор и кабели; включить прибор и проверить загрузку без ошибок.\n3. Восстановить регламентные настройки (если были изменены при ремонте) и сохранить их.\n4. Провести комплексную проверку всех функций: индикаторы, переключатели, звук, связь с планшетом, запись.\n5. Выполнить контрольное короткое сканирование на эталоне для проверки работоспособности."
    },
    {
      "title": "Калибровка дефектоскопа в соответствии с МЕТОДИКОЙ ПОВЕРКИ (калибровки)\n1. Подготовить методику поверки и требуемые эталонные образцы (СО-3Р или другие указанные в методике).\n2. Выполнить калибровку по шагам методики: установить эталон, подключить преобразователь, выполнить регулировки чувствительности и амплитуды.\n3. Зафиксировать показания прибора и сравнить их с нормативными значениями из методики.\n4. При расхождениях выполнить регламентные корректировки и повторить измерения до соответствия."
    },
    {
      "title": "Проверка состояния батареи планшета (замена по необходимости)\n1. Осмотреть планшет на внешние дефекты и следы перегрева.\n2. Проверить состояние батареи в системных настройках (здоровье батареи, циклы зарядки).\n3. При необходимости провести тест автономной работы (зарядить и измерить время работы).\n4. Если батарея не соответствует регламенту — заменить и записать замену в журнал (с указанием даты и серийного номера батареи).\n5. После замены убедиться, что планшет корректно заряжается и передаёт данные."
    },
    {
      "title": "Регулировка натяжения цепей сканера, состояние каретки, замена изношенных деталей, смазка\n1. Отключить питание и обеспечить безопасное положение сканера.\n2. Проверить натяжение цепей и состояние направляющих каретки — нет ли сильного провисания или заеданий.\n3. При необходимости отрегулировать натяжение в соответствии с инструкцией производителя.\n4. Осмотреть каретку на износ направляющих и роликов; заменить изношенные детали.\n5. Нанести смазку на направляющие и подвижные элементы рекомендованным составом, удалить излишки.\n6. Проверить плавность хода каретки вручную и при включённом тестовом режиме."
    }
  ]
}
