{
  "title": "TO3",
  "steps": [
    {
      "title": "Setting up the flaw detector according to technical data\n1. Turn on the instrument and wait for it to fully boot.\n2. Open the settings menu and compare the current parameters with the technical data sheet (sensitivity values, gain, recording speed, etc.).\n3. If necessary, adjust the parameters to match the factory or regulatory data.\n4. Apply and save the settings, make a test recording on the reference block (if possible) to confirm correctness."
    },
    {
      "title": "Replacement of faulty parts, connectors, switches, cables, wires, etc.\n1. Based on the inspection and diagnostic results, compile a list of parts requiring replacement.\n2. Disconnect the power and carefully replace the faulty part with a factory equivalent or a part specified in the regulations.\n3. After replacement, check the functionality of the replaced unit (power-on, test cycles)."
    },
    {
      "title": "Disassembly and repair of ultrasonic probes\n1. Disconnect the power and remove the ultrasonic probes according to the disassembly instructions.\n2. Inspect the plates, contacts, cables, and mounts for damage and corrosion.\n3. Connect the probes and perform a test check of their operation (signal transmission/reception) and record the results."
    },
    {
      "title": "Cleaning the electronic unit housing and flaw detector parts from contamination and corrosion, followed by painting the cleaned areas\n1. Disconnect the power and disassemble the housings (see disassembly step).\n2. Remove dust and dirt with a soft brush and a lint-free cloth.\n3. Clean small areas of corrosion with a brush or fine sandpaper down to bare metal.\n4. Apply anti-corrosion treatment (as per order/regulations) and allow it to dry.\n5. Paint the cleaned areas with suitable paint according to the regulations and allow it to dry completely.\n6. After drying, reassemble the unit and ensure the paint does not interfere with connections and mounts."
    },
    {
      "title": "Assembly, setup, and testing of the flaw detector\n1. Carefully assemble the instrument, return all seals to their places, and fasten the screws in the correct sequence.\n2. Connect the battery and cables; turn on the instrument and check for error-free booting.\n3. Restore the regulatory settings (if they were changed during repair) and save them.\n4. Perform a comprehensive check of all functions: indicators, switches, sound, connection with the tablet, recording.\n5. Perform a control short scan on the reference standard to verify functionality."
    },
    {
      "title": "Calibration of the flaw detector in accordance with the CALIBRATION METHODOLOGY\n1. Prepare the calibration methodology and the required reference blocks (SO-3R or others specified in the methodology).\n2. Perform calibration according to the methodology steps: install the standard, connect the probe, perform sensitivity and amplitude adjustments.\n3. Record the instrument readings and compare them with the standard values from the methodology.\n4. In case of discrepancies, perform regulatory adjustments and repeat measurements until they comply."
    },
    {
      "title": "Checking the condition of the tablet battery (replacement if necessary)\n1. Inspect the tablet for external defects and signs of overheating.\n2. Check the battery condition in the system settings (battery health, charge cycles).\n3. If necessary, perform an autonomous operation test (charge and measure the operating time).\n4. If the battery does not meet the regulations, replace it and record the replacement in the log (indicating the date and battery serial number).\n5. After replacement, ensure the tablet charges correctly and transmits data."
    },
    {
      "title": "Adjusting scanner chain tension, carriage condition, replacement of worn parts, lubrication\n1. Disconnect the power and ensure the scanner is in a safe position.\n2. Check the chain tension and the condition of the carriage guides — ensure there is no significant sagging or jamming.\n3. If necessary, adjust the tension according to the manufacturer's instructions.\n4. Inspect the carriage for wear on the guides and rollers; replace worn parts.\n5. Apply the recommended lubricant to the guides and moving elements, remove excess.\n6. Check the smooth movement of the carriage manually and in test mode when powered on."
    }
  ]
}
